Public Attributes | List of all members
API_RailingNodeType Struct Reference
Element Manager API
Represents a Railing Node element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Railing element owning this Railing Node.
bool  | visible
True, if the Railing Node is visible.
bool  | unifyPatterns
If unifyPatterns is false, than crop segment at Node, otherwise continue the pattern.
bool  | isStatic
True, if the Railing Node is static.
API_RailingPostType  | defPost
The default Railing Post element, from which the Railing Post instances will be generated.
API_RailingRailEndType  | defRailEnd
The default Rail End element, from which the default Rail End instances will be generated.
API_RailingRailEndType  | defHandrailEnd [2]
The default Handrail End elements, from which the Handrail End instances will be generated.
API_RailingRailEndType  | defToprailEnd
The default Toprail End element, from which the Toprail End instances will be generated.
API_RailingRailConnectionType  | defRailConnection
The default Rail Connection element, from which the default Rail Connection instances will be generated.
API_RailingRailConnectionType  | defHandrailConnection [2]
The default Handrail Connection elements, from which the Handrail Connection instances will be generated.
API_RailingRailConnectionType  | defToprailConnection
The default Toprail Connection element, from which the Toprail Connection instances will be generated.
short  | visiblePostNum
Amount of visible posts.
double  | elevation
Vertical offset.
double  | postOffset
Post offset from Node.
UInt32  | nRailConnections
The number of Rail Connections.
UInt32  | nRailEnds
The number of Rail Ends.
bool  | autoConnectionOffset
Offset connections automatically?
bool  | tiltedPost
The post is tilted.
double  | connectionOffset
The connection offset if not automatic.
double  | endingOffset
The ending offset.
Detailed Description
Represents a Railing Node element.
Remarks
Railing Node elements contain Railing Posts, and Rail connections and endings. Each Node represents a vertex in the reference line of the railing.
Member Data Documentation
◆ autoConnectionOffset
 API_RailingNodeType::autoConnectionOffset
Offset connections automatically?
◆ connectionOffset
 API_RailingNodeType::connectionOffset
The connection offset if not automatic.
◆ defHandrailConnection
 API_RailingNodeType::defHandrailConnection
The default Handrail Connection elements, from which the Handrail Connection instances will be generated.
◆ defHandrailEnd
 API_RailingNodeType::defHandrailEnd
The default Handrail End elements, from which the Handrail End instances will be generated.
◆ defPost
 API_RailingNodeType::defPost
The default Railing Post element, from which the Railing Post instances will be generated.
◆ defRailConnection
 API_RailingNodeType::defRailConnection
The default Rail Connection element, from which the default Rail Connection instances will be generated.
◆ defRailEnd
 API_RailingNodeType::defRailEnd
The default Rail End element, from which the default Rail End instances will be generated.
◆ defToprailConnection
 API_RailingNodeType::defToprailConnection
The default Toprail Connection element, from which the Toprail Connection instances will be generated.
◆ defToprailEnd
 API_RailingNodeType::defToprailEnd
The default Toprail End element, from which the Toprail End instances will be generated.
◆ elevation
 API_RailingNodeType::elevation
Vertical offset.
◆ endingOffset
 API_RailingNodeType::endingOffset
The ending offset.
◆ head
 API_RailingNodeType::head
General element header.
◆ isStatic
 API_RailingNodeType::isStatic
True, if the Railing Node is static.
◆ nRailConnections
 API_RailingNodeType::nRailConnections
The number of Rail Connections.
◆ nRailEnds
 API_RailingNodeType::nRailEnds
The number of Rail Ends.
◆ owner
 API_RailingNodeType::owner
GUID of the Railing element owning this Railing Node.
◆ postOffset
 API_RailingNodeType::postOffset
Post offset from Node.
◆ tiltedPost
 API_RailingNodeType::tiltedPost
The post is tilted.
◆ unifyPatterns
 API_RailingNodeType::unifyPatterns
If unifyPatterns is false, than crop segment at Node, otherwise continue the pattern.
◆ visible
 API_RailingNodeType::visible
True, if the Railing Node is visible.
◆ visiblePostNum
 API_RailingNodeType::visiblePostNum
Amount of visible posts.